/* eslint-disable no-irregular-whitespace */
/* eslint-disable no-console */

export default function ConsoleMessage() {
	console.log(
		"%c██   ██ ███████ ██      ██       ██████      ██████  ███████ ██    ██ ███████ ██       ██████  ██████  ███████ ██████  ██\n" +
			"%c██   ██ ██      ██      ██      ██    ██     ██   ██ ██      ██    ██ ██      ██      ██    ██ ██   ██ ██      ██   ██ ██\n" +
			"%c███████ █████   ██      ██      ██    ██     ██   ██ █████   ██    ██ █████   ██      ██    ██ ██████  █████   ██████  ██\n" +
			"%c██   ██ ██      ██      ██      ██    ██     ██   ██ ██       ██  ██  ██      ██      ██    ██ ██      ██      ██   ██   \n" +
			"%c██   ██ ███████ ███████ ███████  ██████      ██████  ███████   ████   ███████ ███████  ██████  ██      ███████ ██   ██ ██",
		"color: #FCD434;",
		"color: #FCD434;",
		"color: #FCD434;",
		"color: #FCD434;",
		"color: #FCD434;"
	);

	console.log(
		"%cProcurando o código fonte? Aqui está ele: " + "%chttps://github.com/Glaysonvisgueira/glaysonvisgueira_next-js\n\n" + "%cNão esqueça de deixar uma estrela! 🌟",
		"font-family: Inter, sans-serif; font-size: 1.2rem; font-weight: 500;",
		"font-family: Inter, sans-serif; font-size: 1.2rem; font-weight: 500; color: #FCD434;",
		"font-family: Inter, sans-serif; font-size: 1.2rem; font-weight: 500;"
	);
}
